const ListData = { 
fruit: [
    "яблоко",
    "банан",
    "груша",
    "апельсин",
    "киви",
    "ананас",
    "манго",
    "персик",
    "гранат",
    "виноград",
    "клубника"
],
  
car: [
    "bmv",
    "mercedes",
    "audi",
    "toyota",
    "honda",
    "ford",
    "chevrolet",
    "volkswagen",
    "nissan",
    "lamborgini"
],
  
tool: [
    "молоток",
    "отвертка",
    "пила",
    "нож",
    "ключ",
    "гаечный ключ",
    "ножовка",
    "плоскогубцы",
    "дрель",
    "кусачки"
],
  
ship: [
    "танкер",
    "контейнеровоз",
    "ферри",
    "круизный лайнер",
    "речной трамвай",
    "яхта",
    "катер",
    "военный корабль",
    "лодка",
],
  
clothingBrand: [
    "nike",
    "adidas",
    "gucci",
    "zara",
    "h&m",
    "levi's",
    "tommy hilfiger",
    "calvin klein",
    "versace",
    "dolce & gabbana",
],
  
vegetable:  [
    "морковь",
    "капуста",
    "огурец",
    "томат",
    "лук",
    "перец",
    "картошка",
    "брокколи",
    "свекла",
    "баклажан"
],
  
animal:  [
    "собака",
    "кошка",
    "лев",
    "тигр",
    "слон",
    "панда",
    "жираф",
    "волк",
    "кенгуру",
    "капибара",
],
  
country: [
    "россия",
    "сша",
    "китай",
    "индия",
    "япония",
    "германия",
    "франция",
    "великобритания",
    "италия",
    "канада",
    "австралия",
    "бразилия",
    "мексика",
    "испания",
    "нидерланды",
    "швейцария",
    "швеция",
    "дания",
    "норвегия",
    "румыния"
],
}


export type ListType = keyof typeof ListData;

export default ListData;